{
    "about-me": {
        "alt": "Über mich",
        "who-i-am": "Wer ich bin",
        "about-me": "Über mich",
        "introduction": "Hallo, ich bin Denis! Seit meiner Weiterbildung zum Frontend-Entwickler habe ich eine große Leidenschaft für Web-Technologien und kreative Problemlösungen entwickelt. Besonders fasziniert mich die Verbindung von Design und Funktionalität – ein gut durchdachtes UI/UX ist für mich genauso wichtig wie sauberer Code.",
        "location-alt": "Standort",
        "location": "Ich lebe in Deutschland und bin offen für Remote-Arbeit sowie spannende Projekte, die mich fachlich herausfordern und weiterbringen.",
        "cognition-alt": "Kognition",
        "cognition": "Ständiges Lernen ist für mich essenziell. Ich liebe es, neue Technologien zu entdecken und meine Fähigkeiten kontinuierlich zu verbessern – sei es durch eigene Projekte, Weiterbildung oder den Austausch mit der Entwickler-Community.",
        "problem-solving-alt": "Problemlösung",
        "problem-solving": "Mein Ansatz zur Problemlösung basiert auf analytischem Denken, Kreativität und Durchhaltevermögen. Ich suche stets nach effizienten und eleganten Lösungen und arbeite gerne im Team, um Herausforderungen gemeinsam zu meistern."
    },

    "skills": {
        "technologies": "Technologien",
        "skill-set": "Fähigkeiten",
        "introduction": "Mein technisches Wissen umfasst HTML, CSS, JavaScript, TypeScript, Angular und Firebase. Zusätzlich arbeite ich mit Material Design, Git und Rest-APIs. Agile Methoden wie Scrum und ein Growth Mindset unterstützen mich dabei, Projekte strukturiert, effizient und zukunftsorientiert umzusetzen.",
        "need": "Brauchst du ",
        "another-skill": "eine weitere Fähigkeit?",
        "contact-me": "Kontaktiere mich gerne. Ich freue mich darauf, mein bisheriges Wissen zu erweitern.",
        "lets-talk": "Lass uns reden",
        "logo-alt": "Logo von {{name}}"
    },

    "references": {
        "title": "Was meine Kollegen über mich sagen"
    },

    "testimonial": {
        "name1": "Alex - Team Partner",
        "text1": "Während unseres Projekts erwies Denis sich als sehr engagiertes und zuverlässiges Teammitglied. Stets lösungsorientiert, teilte er bereitwillig sein Wissen und unterstützte bei Herausforderungen. Seine positive Einstellung trug maßgeblich zum Erfolg unserer gemeinsamen Aufgabe bei. Die Zusammenarbeit mit ihm war sehr wertvoll.",
        "name2": "Rainer Musch - Frontend Developer",
        "text2": "Denis überzeugt durch außergewöhnliche Detailverliebtheit und höchste Präzision in der Umsetzung von CSS- und SCSS-Strukturen. Mit seinem ausgeprägten Sinn für sauberen, wartbaren Code optimiert er Stylesheets bis zur Perfektion. Seine Arbeit hebt die visuelle Qualität und Performance jedes Projekts deutlich an.",
        "name3": "M.Schmittay - Team Partner",
        "text3": "Die akribische und perfektionistische Arbeitsweise in der Frontend-Entwicklung war eine Bereicherung für unser gemeinsames Projekt. Sein Engagement, seine Zuverlässigkeit und seine lösungsorientierte Art trugen maßgeblich zum Erfolg bei. Seine positive Einstellung und Hilfsbereitschaft machten die Zusammenarbeit sehr angenehm."
    }
}
