{
    "header": {
        "about-me": "About Me",
        "skills": "Skills",
        "projects": "Projects",
        "logo-alt": "Denis Welsch Logo"
    },

    "about-me": {
        "alt": "About Me",
        "who-i-am": "Who I Am",
        "about-me": "About me",
        "introduction": "Hello, I'm Denis! Since my training as a frontend developer, I've developed a great passion for web technologies and creative problem-solving. I am particularly fascinated by the connection between design and functionality – a well-thought-out UI/UX is just as important to me as clean code.",
        "location-alt": "Location",
        "location": "I live in Germany and am open to remote work as well as exciting projects that challenge and advance me professionally.",
        "cognition-alt": "Cognition",
        "cognition": "Continuous learning is essential for me. I love discovering new technologies and continuously improving my skills – whether through personal projects, further training, or exchanging ideas with the developer community.",
        "problem-solving-alt": "Problem Solving",
        "problem-solving": "My approach to problem-solving is based on analytical thinking, creativity, and perseverance. I always look for efficient and elegant solutions and enjoy working in a team to tackle challenges together."
    },

    "skills": {
        "technologies": "Technologies",
        "skill-set": "Skill Set",
        "introduction": "My technical expertise includes HTML, CSS, JavaScript, TypeScript, Angular, and Firebase. I also work with Material Design, Git, and Rest APIs. Agile methods like Scrum and a growth mindset help me implement projects in a structured, efficient, and future-oriented way.",
        "need": "You need ",
        "another-skill": "another skill?",
        "contact-me": "Feel free to contact me. I look forward to expanding on my previous knowledge.",
        "lets-talk": "Let's Talk",
        "logo-alt": "Logo of {{name}}"
    },

    "portfolio": {
    "title": "Portfolio",
    "headline": "Featured Projects",
    "introduction": "Explore a selection of my work here - Interact with",
    "interaction-hint": "projects to see my skills in action",
    "preview-alt": "Project Preview",
    "modal": {
        "about": "What is this project about?",
        "github": "GitHub",
        "live-test": "Live Test",
        "close": "X",
        "next-project": "Next Project"
        }
    },

    "project-descriptions": {
    "01": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories.",
    "02": "Jump, run and throw game based on object-oriented approach. Help Pepe to find coins and tabasco salsa to fight against the crazy hen.",
    "03": "This Pokedex project uses the PokéAPI to fetch and display Pokémon information dynamically with HTML, CSS, and JavaScript."
    },

    "references": {
        "title": "What my colleagues say about me"
    },

    "testimonial": {
        "name1": "Alex - Team Partner",
        "text1": "During our project, Denis proved to be a very committed and reliable team member. Always solution-oriented, he willingly shared his knowledge and supported us with challenges. His positive attitude contributed significantly to the success of our joint task. Working with him was very valuable.",
        "name2": "Rainer Musch - Frontend Developer",
        "text2": "Denis impresses with exceptional attention to detail and the highest precision in implementing CSS and SCSS structures. With his strong sense of clean, maintainable code, he optimizes stylesheets to perfection. His work significantly enhances the visual quality and performance of any project.",
        "name3": "M.Schmittay - Team Partner",
        "text3": "His meticulous and perfectionist approach to frontend development was a great asset to our project. His commitment, reliability, and solution-oriented attitude contributed significantly to its success. His positive attitude and willingness to help made the collaboration very pleasant."
    },

    "contact": {
    "title": "Contact",
    "headline": "Let’s work together",
    "subheadline": "Got a problem to solve?",
    "introduction": "I'm always open to interesting projects and collaborating with dedicated teams. If you have an idea or are looking for support in frontend development, tell me about it! Together, we can create something great.",
    "call-to-action": "Need a Frontend developer?",
    "lets-talk-link": "Let’s talk!",
    "name-label": "What's your name?",
    "name-placeholder": "Your name goes here",
    "name-error": "Oops! It seems your name is missing.",
    "email-label": "What's your email?",
    "email-placeholder": "youremail@email.com",
    "email-error": "Oops! Your email is required.",
    "message-label": "How can I help you?",
    "message-placeholder": "Hello Denis, I am interested in...",
    "message-error": "What do you need to develop?",
    "privacy-text-part1": "I've read the",
    "privacy-link": "privacy policy",
    "privacy-text-part2": "and agree to the processing of my data as outlined.",
    "privacy-error": "Please accept the privacy policy.",
    "submit-button": "Say Hello :)"
    }
}
